[
  {
    "text": "Just bought the new iPhone 15! Camera quality is insane 📸 Best upgrade ever!",
    "source": "Twitter",
    "timestamp": "2025-01-17T10:30:00"
  },
  {
    "text": "Tesla's autopilot almost crashed my car today. This is completely unacceptable!",
    "source": "Twitter",
    "timestamp": "2025-01-17T11:45:00"
  },
  {
    "text": "Amazing customer service from Apple Store! They replaced my defective device immediately without any hassle.",
    "source": "Twitter",
    "timestamp": "2025-01-17T09:15:00"
  },
  {
    "text": "Terrible experience with Tesla service center. Waited 3 hours and they couldn't even diagnose the problem.",
    "source": "Reddit",
    "timestamp": "2025-01-17T14:20:00"
  },
  {
    "text": "The new MacBook Pro M3 is an absolute game changer for developers! Compilation times are incredible.",
    "source": "Twitter",
    "timestamp": "2025-01-17T08:45:00"
  },
  {
    "text": "Tesla battery is draining way too fast in cold weather. Very disappointed with the range.",
    "source": "Twitter",
    "timestamp": "2025-01-17T15:30:00"
  },
  {
    "text": "Apple's new iOS 17 update fixed all my battery issues. Finally! Love the new features too.",
    "source": "Reddit",
    "timestamp": "2025-01-17T12:10:00"
  },
  {
    "text": "Tesla Supercharger network is hands down the best thing about owning this car. So convenient!",
    "source": "Twitter",
    "timestamp": "2025-01-17T13:25:00"
  },
  {
    "text": "My iPhone keeps freezing and crashing randomly. Worst phone I've ever had. Regretting this purchase.",
    "source": "Twitter",
    "timestamp": "2025-01-17T16:40:00"
  },
  {
    "text": "Tesla Model 3 is the most fun car I've ever driven! Instant acceleration never gets old.",
    "source": "Reddit",
    "timestamp": "2025-01-17T10:55:00"
  },
  {
    "text": "Apple Watch literally saved my life by detecting an irregular heartbeat. Got medical help just in time!",
    "source": "Twitter",
    "timestamp": "2025-01-17T07:30:00"
  },
  {
    "text": "Latest Tesla software update completely broke my car's infotainment system. Can't even use navigation now.",
    "source": "Twitter",
    "timestamp": "2025-01-17T17:15:00"
  },
  {
    "text": "The Apple ecosystem just works seamlessly. iPhone, Mac, Watch, AirPods - everything syncs perfectly.",
    "source": "Reddit",
    "timestamp": "2025-01-17T11:20:00"
  },
  {
    "text": "Tesla quality control is absolutely terrible. Panel gaps, paint defects everywhere. For $60k this is unacceptable.",
    "source": "Twitter",
    "timestamp": "2025-01-17T18:00:00"
  },
  {
    "text": "AirPods Pro 2 are worth every single penny. Best noise cancellation I've ever experienced!",
    "source": "Twitter",
    "timestamp": "2025-01-17T09:50:00"
  },
  {
    "text": "Got stranded in my Tesla with a dead 12V battery. Customer support was completely useless. Never buying Tesla again.",
    "source": "Reddit",
    "timestamp": "2025-01-17T16:05:00"
  },
  {
    "text": "iPhone 15 Pro battery easily lasts all day with heavy use. Super impressed with the battery optimization!",
    "source": "Twitter",
    "timestamp": "2025-01-17T14:45:00"
  },
  {
    "text": "Tesla paint is already chipping after just 6 months of ownership. This is absolutely unbelievable.",
    "source": "Twitter",
    "timestamp": "2025-01-17T15:55:00"
  },
  {
    "text": "Apple TV+ has some truly amazing original shows. Ted Lasso and Severance are masterpieces!",
    "source": "Reddit",
    "timestamp": "2025-01-17T13:40:00"
  },
  {
    "text": "Tesla Autopilot is genuinely revolutionary technology. I can't imagine driving without it anymore.",
    "source": "Twitter",
    "timestamp": "2025-01-17T12:30:00"
  },
  {
    "text": "Apple Silicon M3 Max is ridiculously powerful. Video rendering that used to take hours now takes minutes!",
    "source": "Twitter",
    "timestamp": "2025-01-17T08:15:00"
  },
  {
    "text": "Tesla service appointment scheduling is a nightmare. Impossible to get a slot within 3 weeks.",
    "source": "Reddit",
    "timestamp": "2025-01-17T17:45:00"
  },
  {
    "text": "Face ID on iPhone works flawlessly even in complete darkness. Such brilliant technology!",
    "source": "Twitter",
    "timestamp": "2025-01-17T19:00:00"
  },
  {
    "text": "My Tesla's screen went completely black while driving on the highway. Extremely dangerous situation!",
    "source": "Twitter",
    "timestamp": "2025-01-17T18:30:00"
  },
  {
    "text": "Apple's privacy features are industry-leading. Finally a company that actually cares about user data protection.",
    "source": "Reddit",
    "timestamp": "2025-01-17T10:20:00"
  },
  {
    "text": "Tesla promised Full Self-Driving years ago. Still waiting. Feels like vaporware at this point.",
    "source": "Twitter",
    "timestamp": "2025-01-17T16:50:00"
  },
  {
    "text": "The iPhone 15 Pro titanium design is stunning and so much lighter than previous models!",
    "source": "Twitter",
    "timestamp": "2025-01-17T11:05:00"
  },
  {
    "text": "Tesla mobile service came to my house and fixed everything. Super convenient and professional!",
    "source": "Reddit",
    "timestamp": "2025-01-17T14:10:00"
  },
  {
    "text": "Apple's App Store policies are anti-competitive and hurt developers. This monopoly needs to end.",
    "source": "Twitter",
    "timestamp": "2025-01-17T15:20:00"
  },
  {
    "text": "Tesla Model Y is the perfect family SUV. Spacious, safe, and fun to drive. Highly recommend!",
    "source": "Twitter",
    "timestamp": "2025-01-17T09:35:00"
  }
]
